gb_in_b=8589934592
mg_in_b=8388608
gb=float(input("Введіть розмір файлу в GB: "))
b=int(input("Введіть швидкість інтернету в bit/sec: "))
t=str(input("\n       (sec/min/hr)\nВиберіть часову одиницю: "))
if t=="sec":
    print(f"Файл розміром {gb} гігабайтів, при швидкісті інтерету {b} бітів на секунду, завантажиться за {(gb * gb_in_b) / b} секунд")
elif t == "min":
    print(f"Файл розміром {gb} гігабайтів, при швидкісті інтерету {b} бітів на секунду, завантажиться за {round(((gb * gb_in_b) / b)/60,3)} хвилин")
elif t == "hr":
    print(f"Файл розміром {gb} гігабайтів, при швидкісті інтерету {b} біти на секунду, завантажиться за {round(((gb * gb_in_b) / b)/3600,3)} годин")