i = 0
while i == 0:
    print("1 - Знайти мінімум\n2 - Знайти максимум\n3 - Вихід з програми")
    d=str(input("Виберіть опцію: "))
    if d == "1":
        a = int(input("Введіть перше число: "))
        b = int(input("Введіть друге число: "))
        print(f"Мінімум чисел {a} i {b} це {min(a,b)}\n")
    elif d == "2":
        a = int(input("Введіть перше число: "))
        b = int(input("Введіть друге число: "))
        print(f"Максимум чисел {a} i {b} це {max(a,b)}\n")
    elif d == "3":
        print("Вихід з програми!")
        break
    else:
        print("Неправильне значення! \n")