i = 0
while i == 0:
    print("1 - Додавання\n2 - Віднімання\n3 - Ділення\n4 - Вихід з програми ")
    d=str(input("Виберіть опцію: "))
    if d == "1":
        a = int(input("Введіть перше число: "))
        b = int(input("Введіть друге число: "))
        print(f"Сума чисел {a} i {b} це {a + b}\n")
    elif d == "2":
        a = int(input("Введіть перше число: "))
        b = int(input("Введіть друге число: "))
        print(f"Різниця чисел {a} i {b} це {a - b}\n")
    elif d == "3":
        a = int(input("Введіть перше число: "))
        b = int(input("Введіть друге число: "))
        print(f"Частка чисел {a} i {b} це {round(a / b, 2)}\n")
    elif d == "4":
        print("Вихід з програми!")
        break
    else:
        print("Неправильне значення! \n")