print("\n*АЛГОРИТМ ГРИ В БОУЛІНГ*\n")

print("1) Вибрати шар для кидку")
print("2) Взяти шар до рук")
print("3) Підійти до доріжки")
print("4) Прицілитися")
print("5) Виконати кидок")
print("6) Почекати поки всі кеглі перестануть рухатись\n")

print("7) Оцінити результат")
print("    7.1) ТИ НЕ ПОПАВ! ")
print("- Ти розчарувався")
print("    7.2) ТИ ВИБИВ 1-5 ")
print("- Ти стаєш більш зусереджений")
print("    7.3) ТИ ВИБИВ 6-9 ")
print("- Ти ти думаєш що це твій максисум")
print("    7.4) СТРАЙК! ")
print("- Ти ти дуже радієш\n")

print("*Ход переходить на наступних гравців (вас 3) поки гра не закінчиться*\n")

print("8) Оцінити результат")
print("    8.1) ТИ ОСТАННІЙ! ")
print("- Ти розчарувався")
print("    8.2) ТИ НА ДРУГОМУ МІСЦІ ")
print("- Ти вже не останній!")
print("    8.3) ТИ ТОП 1!")
print("- Ти переможец цього життя!\n")

print("*Ви з друзями їдете додому*\n")

print("*КІНЕЦЬ АЛГОРИТМУ*")